# CouldNotAdjustWallPartsAtJoin Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PartMakerMethodForWallFailures..::..CouldNotAdjustWallPartsAtJoin Property
BuiltInFailures..::..PartMakerMethodForWallFailures Class See Also
---
Failed to extend or trim some layer at an end join
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CouldNotAdjustWallPartsAtJoin { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CouldNotAdjustWallPartsAtJoin As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CouldNotAdjustWallPartsAtJoin {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PartMakerMethodForWallFailures Class
Autodesk.Revit.DB Namespace